Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རྣམ་པར་གཟིགས་པའི་ཡེ་ཤེས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Samanta­vilokita­jñāna who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དྲི་མ་མེད་པ་ཕུན་སུམ་ཚོགས་པའི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Vimala­śrī­megha who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Siṃha­vijṛmbhita­prabha who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་འབར་བའི་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Jñāna­raśmi­jvalana­cūḍa who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་འོད་གཟེར་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Guṇa­raśmi­dhvaja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཉི་མའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Jñāna­bhāskara­tejas who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་རིན་པོ་ཆེའི་པད་མོ་ཤིན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Ratna­padma­praphullita­gātra who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྒྲོན་མའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Puṇya­pradīpa­dhvaja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འོད་གཟེར་གྱི་སྤྲིན་གྱི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Jñāna­raśmi­megha­prabha who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རྣམ་པར་སྣང་བའི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Samanta­vairocana­candra who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྒྱན་དང་གདུགས་ཀྱི་དབྱངས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Ābharaṇacchatra­nirghoṣa­rāja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་སྣང་བས་རྣམ་པར་གནོན་པའི་སེང་གེ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Samanta­jñānāloka­vikrama­siṃha who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡུལ་གྱི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Dharma­dhātu­viṣaya­mati­candra who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ནམ་མཁའི་སེམས་སྣང་བའི་གཟུགས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Sattva­gagana­citta­pratibhāsa­bimba who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞི་བའི་སྤོས་ཀྱི་གཙུག་བཟང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Praśama­gandha­sunābha who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཞི་བའི་དབྱངས་ཀུན་ཏུ་བསྒྲགས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Samantānuravita­śānta­nirghoṣa who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རབ་ཏུ་བརྟན་པའི་འོད་གཟེར་ཀྱི་དྲ་བའི་གཟུགས་ཀྱི་ཕུང་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Sudṛḍha­jñāna­raśmi­jāla­bimba­skandha who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་རི་བོའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Amṛta­parvata­prabhā­tejas who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་ཚོའི་འབྲུག་སྒྲ་སྒྲོག་པའི་དབྱངས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Dharma­sāgara­nigarjita­ghoṣa who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ནམ་མཁའ་སྣང་བའི་གཙུག་ཕུད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Buddha­gagana­prabhāsa­cūḍa who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་ཟླ་བ་མཛོད་སྤུའི་སྤྲིན་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Raśmi­candrorṇa­megha who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་ཞལ་ཤིན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Suparipūrṇa­jñāna­mukhaktra who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཤིན་ཏུ་རྣམ་པར་དག་པའི་མེ་ཏོག་སྣང་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Suviśuddha­jñāna­kusumāvabhāsa who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོ་བའི་རི་བོ་དཔལ་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Ratnārciḥ­parvata­śrī­tejorāja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱ་ཆེན་པོ་གཟི་བརྗིད་ཀྱི་འོད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Vipula­guṇa­jyotiḥprabha who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་རི་རབ་མངོན་པར་འཕགས་པའི་ཡེ་ཤེས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Samādhi­mervabhyudgata­jñāna who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བའི་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Ratna­candra­dhvaja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་འོད་འཕྲོ་བའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Arcirmaṇḍala­gātra who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཆོག་འོད་ཀྱི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Ratnāgra­prabha­tejas who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་ཀུན་ཏུ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Samanta­jñāna­caryāvilamba who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོ་རྒྱ་མཚོའི་སྒོའི་སྒྲོན་མ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Arciḥ­samudra­mukha­vega­pradīpa who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Dharma­vimāna­nirghoṣa­rāja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་གཞལ་མེད་ཁང་གི་དབྱངས་ཀྱི་རྒྱན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Asadṛśa­guṇa­kīrti­dhvaja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མི་མཚུངས་གྲགས་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཕྱག་རབ་ཏུ་བརྐྱང་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Pralambabāhu who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྔོན་གྱི་སྨོན་ལམ་གྱི་འཕྲུལ་པའི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Pūrva­praṇidhi­nirmāṇa­candra who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ནམ་མཁའི་ཡེ་ཤེས་དོན་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Ākāśa­jñānārtha­pradīpa who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱིས་འཕགས་པའི་ནམ་མཁའི་དབང་ཕྱུག་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Dharmodgata­nabheśvara who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དཔལ་གྱི་སྙིང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Vairocana­śrī­garbha­rāja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་མཐུ་བོ་ཆེའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Dharma­nārāyaṇa­ketu who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Jñānaketu who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོའི་པད་མོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Dharma­sāgara­padma who appeared in the world.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་སྩོགས་པ་འཇིག་རྟེན་གྱི་ཁམས་དེར་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་བྱུང་སྟེ།
en: “Noble one, those and other tathāgatas numbering altogether sixty sextillion appeared in that world realm.

source: དེ་དག་ཐམས་ཅད་ཁོ་མོ་ཅག་གིས་ན་བཟའ་དང་། བཤོས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་ཀྱིས་བསྙེན་བཀུར་ཏོ། །རིམ་གྲོར་བྱས་སོ། །བསྟི་སྟང་དུ་བྱས་སོ། །ཕུ་དུད་དུ་བྱས་སོ། །མཆོད་དོ།
en: I served them all with clothing, food, alms, bedding, medicine during times of illness, and necessary articles, showed them respect, honored them, venerated them, and made offerings to them.

source: །རིགས་ཀྱི་བུ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་ཐ་མར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡང་དག་པར་འབྱུང་བའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, the last of those sixty hundred thousand trillion buddhas was the Tathāgata Arhat Samyak­saṃbuddha Vipula­dharmādhimukti­saṃbhava­tejas.

source: བཅོམ་ལྡན་འདས་དེ་གྲོང་ཁྱེར་དུ་གཤེགས་པ་ལ་ཁོ་མོ་རྒྱལ་པོའི་ཆུང་མར་གྱུར་ཏེ།
en: When that tathāgata came to the city, I was the king’s wife.

source: ཁྱིམ་ཐབ་དང་བཅས་པས་དེ་བཞིན་གཤེགས་པའི་མཆོད་པ་མཆོད་པའི་སྒོ་རྣམ་པ་ཐམས་ཅད་དུ་བཤམས་པས་མཆོད་པ་བྱས་ནས་བཅོམ་ལྡན་འདས་དེ་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱེ་བ་འབྱུང་བའི་སྒྲོན་མ་ཞེས་བྱ་བ་ཐོས་སོ།
en: Together with householders, we practiced the gateways of every kind of offering, and after making offerings with the offerings for a tathāgata, we heard from that bhagavat the Dharma teaching called The Lamp of the Arising of the Births of All the Tathāgatas

source: །དེ་ཐོས་ནས་ཁོ་མོས་ཡེ་ཤེས་ཀྱི་མིག་རབ་ཏུ་ཐོབ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བའི་ཡུལ་འདི་ཡང་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: On hearing that, I attained the eyes of wisdom, and I attained this bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་རྣམ་པར་ཐར་བ་འདི་ལ་སྒོམ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱོད་ཅིང་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་རྒྱུ་རྒྱུ་སྟེ།
en: “Noble one, meditating on this liberation, I practiced bodhisattva conduct together with the bodhisattva for kalpas as numerous as the atoms in a hundred thousand buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་སྙེད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བསྐལ་པ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་མཐའ་དང་དབུས་མེད་པ་ཞིག་བསྙེན་བཀུར་ནས།
en: During those kalpas as numerous as the atoms in that number of buddha realms, I served a vast extent of tathāgatas without end or middle.

source: བསྐལ་པ་ལ་ལ་ནི་དེ་བཞིན་གཤེགས་བ་བསྐལ་པར་བཞུགས་པ་གཅིག་ཀྱང་བསྙེན་བཀུར་ཏོ།
en: In some kalpas, I served a single tathāgata who remained for an entire kalpa.

source: །བསྐལ་པ་ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པ་གཉིས་ཀྱང་བསྙེན་བཀུར་ཏོ།
en: In some kalpas, I served two tathāgatas.

source: །བསྐལ་པ་ལ་ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པ་བརྗོད་དུ་མེད་པའི་བར་དག་ཀྱང་བསྙེན་བཀུར་ཏོ།
en: In some kalpas, I served countless tathāgatas.

source: །བསྐལ་པ་ལ་ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་བསྙེན་བཀུར་ཏེ།
en: In some kalpas, I served as many tathāgatas as there are atoms in a buddha realm.

source: དེ་སྲིད་དུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་ཡང་ཚད་ནི་ཇི་ཙམ་ཞིག །དབྱིབས་ནི་ཇི་ལྟ་བུ་ཞིག། སྐུ་མདོག་ནི་ཅི་འདྲ་བ་ཞིག་ཡིན་པ་ཁོང་དུ་ཆུད་དོ།
en: “During that time, my bodhisattva bodies’ sizes, shapes, and colors were beyond comprehension.

source: །སྐུའི་ཕྲིན་ལས་ཀྱང་ཁོང་དུ་མ་ཆུད།
en: The activities of my bodies were beyond comprehension.

source: གསུང་གི་ཕྲིན་ལས་དང་ཐུགས་ཀྱི་ཕྲིན་ལས་ཀྱང་ཁོང་དུ་མ་ཆུད་དོ།
en: The activities of my speech and of my mind were beyond comprehension.

source: །ཡེ་ཤེས་ཀྱི་གཟིགས་པ་དང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་། ཡེ་ཤེས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་ཡང་ཁོང་དུ་མ་ཆུད་དོ།
en: My wisdom’s sight, my wisdom’s range of activity, and the scope of my wisdom’s samādhi were also beyond comprehension.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་ཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པ་མཐོང་ནས། བྱང་ཆུབ་སེམས་དཔལ་ལ་དགའ་བའི་སེམས་སྐྱེས་ཏེ། བརྡ་སྣ་ཚོགས་དང་བསྙེན་པ་སྣ་ཚོགས་ཀྱིས་མོས་པ་བསྐྱེད་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཐབས་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བཟུང་སྟེ།
en: “Noble one, when beings see a bodhisattva and the practice of bodhisattva conduct, they admire the bodhisattva and with various gestures and approaches are attracted to the bodhisattva who cares for them through various worldly and nonworldly ways, so that they became the bodhisattva’s followers.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དུ་གྱུར་རོ། །དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ་འཁོར་དུ་འགྲོགས་འགྲོགས་པས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མྱི་ལྡོག་པར་གྱུར་ཏོ།
en: When they accompany as followers the bodhisattva who practices bodhisattva conduct, they become irreversible in their progress to the highest, complete enlightenment.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡང་དག་པར་འབྱུང་བའི་གཟི་བརྗིད་ཀྱི་ཞལ་མཐོང་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ལ་རྣམ་པར་ལྟ་བའི་ཡུལ་འདི་ཐོབ་ནས།
en: “Noble one, in that way, as soon as I saw the Tathāgata Vipula­dharmādhimukti­saṃbhava­tejas, I attained this bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas

source: རྣམ་པར་ཐར་པ་འདི་སྒོམ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་དང་བསྐལ་བ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་འགྲོགས་འགྲོགས་ཏེ།
en: Meditating on this liberation, I accompanied the bodhisattva for kalpas as numerous as the atoms in a hundred buddha realms.

source: བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་བསྙེན་བཀུར་ཏོ། །མཆོད་དོ་རིམ་གྲོར་བྱས་སོ།
en: I served, made offerings to, and venerated all the tathāgatas that appeared during those kalpas as numerous as the atoms in buddha realms.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཁོ་མོས་ཆོས་བསྟན་པ་ཐོས་ཏེ།
en: I heard the teaching of the Dharma from all those tathāgatas, obtaining it and keeping it.

source: ཡོངས་སུ་བླངས་སོ། །ཡང་དག་པར་གཟུང་ངོ་། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཁོ་མོས་རྣམ་པར་ཐར་པ་འདི་ཚུལ་སྣ་ཚོགས་དང་། མདོ་སྡེའི་ཚུལ་གྱི་གསུང་སྣ་ཚོགས་དང་། རྣམ་པར་ཐར་པའི་རང་བཞིན་སྣ་ཚོགས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྣ་ཚོགས་དང་། རྣམ་པར་ཐར་པའི་རྒྱུད་སྣ་ཚོགས་དང་། དུས་ལ་འཇུག་པ་སྣ་ཚོགས་དང་། ཞིང་རྒྱ་མཚོ་ལ་འཇུག་པ་སྣ་ཚོགས་དང་། སངས་རྒྱས་བལྟ་བ་རྒྱ་མཚོ་རྣམ་པར་དམྱིགས་པར་བྱ་བ་སྣ་ཚོགས་དང་། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་འཇུག་པ་སྣ་ཚོགས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྒྱ་མཚོའི་ཚུལ་གྱི་ལམ་སྣ་ཚོགས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པ་སྣ་ཚོགས་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འབྱམ་ཀླས་པ་སྣ་ཚོགས་ཀྱིས་ཐོབ་པར་གྱུར་ཀྱང་།
en: I also obtained from all those buddha bhagavats this liberation through various ways, through various teachings of the ways of the sūtras, through various natures of liberation, through various entrances to liberation, through various practices of liberation, through various engagements in times, through various entries into realms, through various perceptions of oceans of visions of buddhas, through various entries into the circles of followers of tathāgatas, through various paths of the ways of oceans of bodhisattva prayers, through various accomplishments of bodhisattva conduct, and through various vast extents of bodhisattva liberations.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་ཚུལ་ནི་ཁོང་དུ་མ་ཆུད་དོ།
en: However, I still had not realized the way of completely good bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་རྣམས་ཀྱི་རྣམ་པར་ཐར་པའི་ཚུལ་ནི་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པར་ཚད་མྱེད་དོ། །སེམས་ཅན་གྱི་མིང་དུ་བྱ་བ་ཐམས་ཅད་ཀྱི་དབྱིངས་ལྟར་ཚད་མྱེད་དོ། །དུས་གསུམ་གྱི་རྒྱུད་རྒྱ་མཚོའི་དབྱིངས་ལྟར་ཚད་མེད་དོ། །ཕྱོགས་རྒྱ་མཚོའི་དབྱིངས་ལྟར་ཚད་མེད་དོ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོའི་དབྱིངས་ལྟར་ཚད་མེད་དོ།
en: Because the way of the liberation of completely good bodhisattvas is as immeasurable as the extent of space, as immeasurable as the extent of the conceptualizations of beings, as immeasurable as the extent of the ocean of the divisions of the three times, as immeasurable as the extent of the ocean of the directions, and as immeasurable as the extent of the ocean of the ways of the realm of phenomena.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་རྣམས་ཀྱི་རྣམ་པར་ཐར་པའི་ཚུལ་གྱི་ལུས་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་དང་མཉམ་པའོ།
en: “Noble one, the nature of the way of the liberations of the completely good bodhisattvas is the same as the scope of perception of the tathāgatas.

source: །དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་མོས་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་ལ་ལྟ་ལྟ་ཡང་བལྟ་བས་མ་ངོམས་ཏེ།
en: “In that way, noble one, for kalpas as numerous as the atoms in buddha realms I gazed again and again upon the bodhisattva’s body without ever having enough of seeing it.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གཅིག་ཏུ་འདོད་ཆགས་ལ་སྤྱོད་པའི་སྐྱེས་པ་དང་བུད་མེད་ཕན་ཚུན་ནས་ཕྲད་བར་དུས་བྱས་པ་གཉིས་ལ་ནི་སེམས་ཀྱི་རྒྱུད་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ལས་བྱུང་བ་གཙང་བའི་འདུ་ཤེས་དང་། རྣམ་པར་རྟོག་པས་མྱོས་པ་ལས་བྱུང་བ་ཚད་མྱེད་པ་ཞིག་སྐྱེའོ།
en: “Noble one, it was like when a man and woman have arranged to come together purely for the enjoyment of passion, and there arises an immeasurable development of their state of mind through their being intoxicated by the concepts and thoughts of purity that arise from fallacious mental activity.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་ལ་ལྟ་ན་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་འབྱམ་ཀླས་པ་མཐའ་དང་དབུས་མེད་པ་ཚད་མེད་པར་ཤིན་ཏུ་བསྟན་པ་གཞི་སྣ་ཚོགས་དང་ལྡན་པ། མཚམས་ཀྱི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པ་དབྱིབས་སྣ་ཚོགས་དང་ལྡན་པ་རིའི་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་སའི་གཞིའི་རྒྱན་སྣ་ཚོགས་བསྟན་དུ་ཡོད་པ་སྤྲིན་སྣ་ཚོགས་དང་ལྡན་པའི་ནམ་མཁའ་ཀུན་ནས་ཁྱབ་པའི་རྒྱན་དང་ལྡན་པ། ཚུལ་དང་མྱིང་དང་གྲངས་སྣ་ཚོགས་སུ་བརྗོད་པ་སངས་རྒྱས་འབྱུང་བ་དང་དེ་བཞིན་གཤེགས་པའི་རྒྱུད་སྣ་ཚོགས་འབྱུང་བ་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པ། མདོ་སྡེའི་ཚུལ་སྣ་ཚོགས་ཤིན་ཏུ་བསྟན་པའི་སྒྲ་འབྱུང་བ། ཐེག་པའི་ཚུལ་སྣ་ཚོགས་མངོན་པར་བསྒྲུབ་པ་འབྱུང་བ་དང་ལྡན་པ།
en: “Noble one, in the same way, when I looked upon the bodhisattva’s body, in each instant of mind, from each pore there appeared to my eyes an immeasurable vast extent of groups of world realms without end or middle, with various grounds, various arrays of borders, various shapes, various arrays of mountains, various displays of arrays of grounds, various skies adorned by coverings of clouds, various natures, names, and numbers, and various appearances of buddhas and successions of tathāgatas, adorned by various bodhimaṇḍas, with various miraculous manifestations of the turning of the Dharma wheel by tathāgatas, with various arrays of the circles of followers of tathāgatas, with the various sounds of the teaching of the various ways of the sūtras, with the various accomplishments of the ways of the yānas, with the various illuminations from pure lights and radiances, and with omens that have never been seen before.

source: ཡོངས་སུ་དག་པའི་འོད་དང་སྣང་བ་སྣ་ཚོགས་ཀྱི་རབ་ཏུ་སྣང་བ་མཚན་མ་སྔན་ཆད་མ་མཐོང་བ་དག་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་མྱིག་ལམ་དུ་སྣང་ངོ་།
en: “From each pore there appeared to my eyes oceans of buddhas without end or middle.

source: །བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སངས་རྒྱས་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་སྣ་ཚོགས་མངའ་བ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་ལྡན་པ་མདོ་སྡེའི་ཚུལ་སྣ་ཚོགས་སྒྲོག་པའི་རྣམ་པར་འཕྲུལ་པ་དང་ལྡན་པ་དག་ཀྱང་རྒྱུན་མི་འཆད་པའི་ཚུལ་དུ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་མྱིག་ལམ་དུ་སྣང་ངོ་།
en: In each instant of mind, from each pore, there appeared continuously to my eyes the adornment of various bodhimaṇḍas, the miraculous manifestations of the various turnings of the Dharma wheel, and the miraculous manifestations of the sounds of the various ways of the sūtras.

source: །བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ཁྱིམ་དང་ཀུན་དགའི་ར་བ་དང་རི་དང་གཞལ་མེད་ཁང་དང་ཆུ་ཀླུང་དང་རྒྱ་མཚོ་ལ་གནས་པ་གཟུགས་དང་ལུས་སྣ་ཚོགས་ཅན་ལོངས་སྤྱོད་ཀྱི་ཡུལ་སྣ་ཚོགས་དང་ལྡན་པ། སྤྱོད་པ་དང་སྤྱོད་ཡུལ་དང་སྦྱོར་བ་སྣ་ཚོགས་དང་ལྡན་པ། དབང་པོ་སྣ་ཚོགས་སུ་བསྒྲུབ་པའི་ཚུལ་དང་ལྡན་པ་དག་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་མྱིག་ལམ་དུ་སྣང་ངོ་།
en: “In each instant of mind, from each pore, there appeared to my eyes a vast ocean of beings without end or middle, with houses, parks, divine palaces, rivers, oceans, and dwellings, with various forms and bodies, with various ranges of enjoyments, with various engagements in conduct and behavior, and with various forms of perfections of faculties.

source: །བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་དུས་གསུམ་རྒྱ་མཚོ་ལ་འཇིག་པའི་ཚུལ་མཐའ་དང་དབུས་མེད་པ་ཞིག་མིག་ལམ་དུ་སྣང་ངོ་།
en: “From each pore there appeared to my eyes ways of entering an ocean of the three times, without end or middle.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ཞིག་ནི་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: “An ocean, without end or middle, of bodhisattva prayers were purified.

source: །བྱང་ཆུབ་སེམས་དཔའི་སའི་སྤྱོད་པ་རྣམ་པ་ཐ་དད་པ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་།
en: “There appeared an ocean, without end or middle, of different forms of conduct of the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཡོངས་སུ་དག་པ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་།
en: “There appeared a pure ocean, without end or middle, of the perfections of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་།
en: “There appeared an ocean, without end or middle, of the past practices of the bodhisattvas.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་།
en: “There appeared an ocean, without end or middle, of the ways of purifying buddha realms.

source: །བྱང་ཆུབ་སེམས་དཔའི་བྱམས་པ་ཆེན་པོའི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་།
en: “There appeared an ocean, without end or middle, of the ways of the great love of bodhisattvas.

source: །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་གདུལ་བའི་མཐུ་དང་ཐབས་རྒྱ་མཚོ་དག་ལའང་འཇུག་ཅིང་ཁོང་དུ་ཆུད་དོ།
en: “I comprehended their entering oceans of the power and methods for ripening and guiding all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་གྱི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་འགྲུབ་བོ།
en: “They accomplished an ocean, without end or middle, of the ways of the clouds of the great compassion of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་དགའ་བའི་ཤུགས་ཆེན་པོ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་རྣམ་པར་འཕེལ་ཏེ།
en: “They increased an ocean, without end or middle, of the great power of the joy of bodhisattvas.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་རབ་ཏུ་འགྲུབ་བོ།
en: “In each instant of mind, they accomplished an ocean, without end or middle, of the methods of gathering all beings.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་བསྐལ་བ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་བ་སྤུའི་སྒོ་རེ་རེ་ཞིང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་ཞུགས་ཏེ།
en: “Noble one, in that way, for kalpas as numerous as the atoms in a hundred buddha realms, in each instant of mind I perceived and comprehended an ocean, without end or middle, of the ways of the Dharma in each pore of the bodhisattva.
